// Опции
export default {
	money: 1000000, // Начальное количество денег
	txtSpin: 'SPIN', // Текст кнопки "SPIN"
	txtAutoSpin: 'AUTO', // Текст кнопки "AUTO"
	txtAuto : 5, // Количество автоматических спинов
	moneyWin: 0, // Выигрыш
	txtMaxBet: 'MAXBET', // Текст кнопки "MAXBET"
	coin: 10, // Значение монеты
	txtCoin: 'COIN', // Текст кнопки "COIN"
	line: 1, // Номер линии
	txtLine: 'LINES', // Текст кнопки "LINES"
	txtInfo: 'INFO', // Текст кнопки "INFO"
	win: 0, // Выигрыш
	lineArray: [], // Массив линий
	result: [], // Результат
	winningLines : [], // Выигрышные линии
	i: 0, // Индекс
	hsv: [], // Массив для HSV
	// Значения символов от 0 до 9
	payvalues: [
		[100, 150, 200],
		[50, 100, 150],
		[25, 50, 100],
		[25, 50, 100],
		[15, 25, 50],
		[10, 20, 35],
		[10, 15, 25],
		[10, 15, 20],
		[5, 10, 20],
		[3, 8, 18]
	],
	// Максимальное количество линий - 20
	payLines: [
		[[0, 1], [1, 1], [2, 1], [3, 1], [4, 1]], //line 1
		[[0, 0], [1, 0], [2, 0], [3, 0], [4, 0]], //line 2
		[[0, 2], [1, 2], [2, 2], [3, 2], [4, 2]], //line 3
		[[0, 0], [1, 1], [2, 2], [3, 1], [4, 0]], //line 4
		[[0, 2], [1, 1], [2, 0], [3, 1], [4, 2]], //line 5
		// [[0, 1], [1, 0], [2, 0], [3, 0], [4, 1]], //line 6
		// [[0, 1], [1, 2], [2, 2], [3, 2], [4, 1]], //line 7
		// [[0, 0], [1, 0], [2, 1], [3, 2], [4, 2]], //line 8
		// [[0, 2], [1, 2], [2, 1], [3, 0], [4, 0]], //line 9
		// [[0, 1], [1, 2], [2, 1], [3, 0], [4, 1]], //line 10
		// [[0, 1], [1, 0], [2, 1], [3, 2], [4, 1]], //line 11
		// [[0, 0], [1, 1], [2, 1], [3, 1], [4, 0]], //line 12
		// [[0, 2], [1, 1], [2, 1], [3, 1], [4, 2]], //line 13
		// [[0, 0], [1, 1], [2, 0], [3, 1], [4, 0]], //line 14
		// [[0, 2], [1, 1], [2, 2], [3, 1], [4, 2]], //line 15
		// [[0, 1], [1, 1], [2, 0], [3, 1], [4, 1]], //line 16
		// [[0, 1], [1, 1], [2, 2], [3, 1], [4, 1]], //line 17
		// [[0, 0], [1, 0], [2, 2], [3, 0], [4, 0]], //line 18
		// [[0, 2], [1, 2], [2, 0], [3, 2], [4, 2]], //line 19
		// [[0, 0], [1, 2], [2, 2], [3, 2], [4, 0]] //line 20
	],
	checkClick: false, // Проверка клика
	symbolHeight: 140, // Высота символа
	duration: 50, // Продолжительность
	repeat: [5, 10, 15, 20, 25] // Повторение
};